#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mgoogle_project_service.iamcredentials: Refreshing state... [id=sam-nash/iamcredentials.googleapis.com][0m
[0m[1mgoogle_service_account.sa: Refreshing state... [id=projects/sam-nash/serviceAccounts/project-sa@sam-nash.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_service.cloudresourcemanager: Refreshing state... [id=sam-nash/cloudresourcemanager.googleapis.com][0m
[0m[1mgoogle_project_service.sts: Refreshing state... [id=sam-nash/sts.googleapis.com][0m
[0m[1mgoogle_project_service.iam: Refreshing state... [id=sam-nash/iam.googleapis.com][0m
[0m[1mgoogle_storage_bucket.terraform_state: Refreshing state... [id=sam-nash-terraform-state][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # google_compute_instance.vm_instance[0m will be created
[0m  [32m+[0m[0m resource "google_compute_instance" "vm_instance" {
      [32m+[0m[0m can_ip_forward       = false
      [32m+[0m[0m cpu_platform         = (known after apply)
      [32m+[0m[0m creation_timestamp   = (known after apply)
      [32m+[0m[0m current_status       = (known after apply)
      [32m+[0m[0m deletion_protection  = false
      [32m+[0m[0m effective_labels     = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m instance_id          = (known after apply)
      [32m+[0m[0m label_fingerprint    = (known after apply)
      [32m+[0m[0m machine_type         = "e2-medium"
      [32m+[0m[0m metadata_fingerprint = (known after apply)
      [32m+[0m[0m min_cpu_platform     = (known after apply)
      [32m+[0m[0m name                 = "my-vm-instance"
      [32m+[0m[0m project              = "sam-nash"
      [32m+[0m[0m self_link            = (known after apply)
      [32m+[0m[0m tags_fingerprint     = (known after apply)
      [32m+[0m[0m terraform_labels     = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m zone                 = "asia-southeast1-a"

      [32m+[0m[0m boot_disk {
          [32m+[0m[0m auto_delete                = true
          [32m+[0m[0m device_name                = (known after apply)
          [32m+[0m[0m disk_encryption_key_sha256 = (known after apply)
          [32m+[0m[0m kms_key_self_link          = (known after apply)
          [32m+[0m[0m mode                       = "READ_WRITE"
          [32m+[0m[0m source                     = (known after apply)

          [32m+[0m[0m initialize_params {
              [32m+[0m[0m image                  = "debian-cloud/debian-11"
              [32m+[0m[0m labels                 = (known after apply)
              [32m+[0m[0m provisioned_iops       = (known after apply)
              [32m+[0m[0m provisioned_throughput = (known after apply)
              [32m+[0m[0m resource_policies      = (known after apply)
              [32m+[0m[0m size                   = (known after apply)
              [32m+[0m[0m type                   = (known after apply)
            }
        }

      [32m+[0m[0m confidential_instance_config (known after apply)

      [32m+[0m[0m guest_accelerator (known after apply)

      [32m+[0m[0m network_interface {
          [32m+[0m[0m internal_ipv6_prefix_length = (known after apply)
          [32m+[0m[0m ipv6_access_type            = (known after apply)
          [32m+[0m[0m ipv6_address                = (known after apply)
          [32m+[0m[0m name                        = (known after apply)
          [32m+[0m[0m network                     = "default"
          [32m+[0m[0m network_ip                  = (known after apply)
          [32m+[0m[0m stack_type                  = (known after apply)
          [32m+[0m[0m subnetwork                  = (known after apply)
          [32m+[0m[0m subnetwork_project          = (known after apply)

          [32m+[0m[0m access_config {
              [32m+[0m[0m nat_ip       = (known after apply)
              [32m+[0m[0m network_tier = (known after apply)
            }
        }

      [32m+[0m[0m reservation_affinity (known after apply)

      [32m+[0m[0m scheduling (known after apply)
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @sam-nash, Action: ``, Working Directory: "google_cloud/terraform", Workflow: `Terraform CI/CD`*